In [1]:
import pandas as pd
import numpy as np

In [3]:
dict1={'Name':['Ramesh','Suresh',np.nan,'Mahesh'],'Age':[31,32,33,np.nan],'City':[np.nan,'Hyd','Mumbai','Chennai']}
data1=pd.DataFrame(dict1)
data1

     Name   Age     City
0  Ramesh  31.0      NaN
1  Suresh  32.0      Hyd
2     NaN  33.0   Mumbai
3  Mahesh   NaN  Chennai

In [4]:
data1.isnull()

    Name    Age   City
0  False  False   True
1  False  False  False
2   True  False  False
3  False   True  False

In [5]:
data1.isnull().sum()
#every column has one missing value

Name    1
Age     1
City    1
dtype: int64

In [6]:
#percentage 
data1.isnull().sum()/len(data1)

Name    0.25
Age     0.25
City    0.25
dtype: float64

In [7]:
data1.isnull().sum()*100/len(data1)

Name    25.0
Age     25.0
City    25.0
dtype: float64

In [9]:
dict2={'Name':['Ramesh','Suresh',None,'Mahesh'],'Age':[31,32,33,None],'City':[None,'Hyd','Mumbai','Chennai']}
data2=pd.DataFrame(dict2)
data2

     Name   Age     City
0  Ramesh  31.0     None
1  Suresh  32.0      Hyd
2    None  33.0   Mumbai
3  Mahesh   NaN  Chennai

In [10]:
data2.isnull()
#name is the catagorical so none is coming but Age is numerical so its come as not a number NaN in the avobe

    Name    Age   City
0  False  False   True
1  False  False  False
2   True  False  False
3  False   True  False

In [11]:
data2.isnull().sum()

Name    1
Age     1
City    1
dtype: int64

In [15]:
dict3={'Name':['Ramesh','Suresh','null','Mahesh'],'Age':[31,32,33,'null'],'City':['null','Hyd','Mumbai','Chennai']}
data3=pd.DataFrame(dict3)
data3

     Name   Age     City
0  Ramesh    31     null
1  Suresh    32      Hyd
2    null    33   Mumbai
3  Mahesh  null  Chennai

In [14]:
data3.isnull().sum()
#the name itself is null

Name    0
Age     0
City    0
dtype: int64

In [20]:
#method 1
data1.fillna(40)

     Name   Age     City
0  Ramesh  31.0       40
1  Suresh  32.0      Hyd
2      40  33.0   Mumbai
3  Mahesh  40.0  Chennai

In [21]:
data1['Name'].fillna('Satish')

0    Ramesh
1    Suresh
2    Satish
3    Mahesh
Name: Name, dtype: object

In [22]:
#method3
data1.fillna(method='backfill')
#name index 2 is the missing value it replace by index3
#age index

     Name   Age     City
0  Ramesh  31.0      Hyd
1  Suresh  32.0      Hyd
2  Mahesh  33.0   Mumbai
3  Mahesh   NaN  Chennai

In [23]:
data1.fillna(method='bfill')

     Name   Age     City
0  Ramesh  31.0      Hyd
1  Suresh  32.0      Hyd
2  Mahesh  33.0   Mumbai
3  Mahesh   NaN  Chennai

In [24]:
data1.fillna(method='ffill')

     Name   Age     City
0  Ramesh  31.0      NaN
1  Suresh  32.0      Hyd
2  Suresh  33.0   Mumbai
3  Mahesh  33.0  Chennai

In [25]:
data1.fillna(method='pad')

     Name   Age     City
0  Ramesh  31.0      NaN
1  Suresh  32.0      Hyd
2  Suresh  33.0   Mumbai
3  Mahesh  33.0  Chennai

In [27]:
#method4
#mean,median,mode
age_mean=data1['Age'].mean()
age_mean

32.0

In [28]:
data1['Age'].fillna(age_mean)

0    31.0
1    32.0
2    33.0
3    32.0
Name: Age, dtype: float64

In [29]:
#median
age_median=data1['Age'].median()
age_median

32.0

In [30]:
data1['Age'].fillna(age_median)

0    31.0
1    32.0
2    33.0
3    32.0
Name: Age, dtype: float64

In [32]:
#mode
age_mode=data1['City'].mode()
age_mode
data1['City'].fillna(age_mode)

0    Chennai
1        Hyd
2     Mumbai
3    Chennai
Name: City, dtype: object

In [36]:
#KNN imputer
from sklearn.impute import KNNImputer
knn=KNNImputer(n_neighbors=2)
knn.fit_transform(data1[['Age']])

array([[31.],
       [32.],
       [33.],
       [32.]])